In [1]:
import pandas as pd

In [2]:
dataset=pd.read_csv(r"E:\tops\Data science\practical\loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [5]:
dataset["Dependents"].value_counts()

Dependents
0     345
1     102
2     101
3+     51
Name: count, dtype: int64

In [9]:
dataset["Education"].dtypes

dtype('O')

In [6]:
dataset["Education"].value_counts()

Education
Graduate        480
Not Graduate    134
Name: count, dtype: int64

In [10]:
dataset["Education"]=dataset["Education"].replace({"Graduate":1,"Not Graduate":0})

C:\Users\thako\AppData\Local\Temp\ipykernel_15192\1332536.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  dataset["Education"]=dataset["Education"].replace({"Graduate":1,"Not Graduate":0})

In [11]:
dataset["Education"].value_counts()

Education
1    480
0    134
Name: count, dtype: int64

In [13]:
dataset["Education"]=dataset["Education"].astype("int64")

In [28]:
dataset.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education              int64
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area          int64
Loan_Status           object
dtype: object

In [16]:
dataset["Property_Area"].value_counts()

Property_Area
Semiurban    233
Urban        202
Rural        179
Name: count, dtype: int64

In [20]:
dataset["Property_Area"]=dataset["Property_Area"].replace({"Semiurban":0,"Urban":1,"Rural":2})
dataset["Property_Area"]=dataset["Property_Area"].astype("int64")

In [48]:
dataset.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,1.0,No,0,1,No,5849,0.0,NaN,360.0,1.0,1,1
1,LP001003,1.0,Yes,1,1,No,4583,1508.0,128.0,360.0,1.0,2,0
2,LP001005,1.0,Yes,0,1,Yes,3000,0.0,66.0,360.0,1.0,1,1
3,LP001006,1.0,Yes,0,0,No,2583,2358.0,120.0,360.0,1.0,1,1
4,LP001008,1.0,No,0,1,No,6000,0.0,141.0,360.0,1.0,1,1

In [23]:
dataset["Loan_Status"].value_counts()

Loan_Status
Y    422
N    192
Name: count, dtype: int64

In [41]:
dataset["Loan_Status"]=dataset["Loan_Status"].replace({"Y":1,"N":0})
#dataset["Loan_Status"]=dataset["Loan_Status"].astype("int64")

In [42]:
dataset["Loan_Status"]=dataset["Loan_Status"].astype("int64")

In [44]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    int64
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    int64
 12  Loan_Status        614 non-null    int64
dtypes: float64(4), int64(4), object(5)
memory usage: 62.5+ KB

In [74]:
dataset["Gender"].value_counts()

Gender
1.0    489
0.0    112
Name: count, dtype: int64

In [77]:
dataset.isnull().sum()

Loan_ID               0
Gender                0
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [76]:
#dataset["Gender"] = dataset["Gender"].fillna(dataset["Gender"].mode()[0])
dataset["Gender"] = dataset["Gender"].fillna(dataset["Gender"].mode()[0])

In [72]:
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,1.0,No,0,1,No,5849,0.0,NaN,360.0,1.0,1,1
1,LP001003,1.0,Yes,1,1,No,4583,1508.0,128.0,360.0,1.0,2,0
2,LP001005,1.0,Yes,0,1,Yes,3000,0.0,66.0,360.0,1.0,1,1

In [78]:
dataset["Gender"]=dataset["Gender"].replace({"1":1,"0":0})

In [79]:
dataset["Gender"]=dataset["Gender"].astype("int64")

In [80]:
dataset.dtypes

Loan_ID               object
Gender                 int64
Married               object
Dependents            object
Education              int64
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area          int64
Loan_Status            int64
dtype: object

In [81]:
dataset["Self_Employed"].value_counts()

Self_Employed
No     500
Yes     82
Name: count, dtype: int64

In [82]:
dataset["Self_Employed"]=dataset["Self_Employed"].fillna(dataset["Self_Employed"].mode()[0])

In [83]:
dataset.isnull().sum()

Loan_ID               0
Gender                0
Married               3
Dependents           15
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [84]:

dataset["Self_Employed"].value_counts()

Self_Employed
No     532
Yes     82
Name: count, dtype: int64

In [87]:
dataset["Self_Employed"]=dataset["Self_Employed"].replace({"No":0,"Yes":1})
dataset["Self_Employed"]=dataset["Self_Employed"].astype("int64")

In [92]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             614 non-null    int64
 2   Married            614 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    int64
 5   Self_Employed      614 non-null    int64
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    int64
 12  Loan_Status        614 non-null    int64
dtypes: float64(4), int64(6), object(3)
memory usage: 62.5+ KB

In [90]:
dataset["Married"].value_counts()

Married
Yes    398
No     213
Name: count, dtype: int64

In [91]:
dataset["Married"]=dataset["Married"].fillna(dataset["Married"].mode()[0])

In [93]:
dataset["Married"]= dataset["Married"].replace({"Yes":1,"No":0})

C:\Users\thako\AppData\Local\Temp\ipykernel_15192\2454172590.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  dataset["Married"]= dataset["Married"].replace({"Yes":1,"No":0})

In [94]:
dataset["Married"]=dataset["Married"].astype("int64")

In [98]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             614 non-null    int64
 2   Married            614 non-null    int64
 3   Dependents         614 non-null    int64
 4   Education          614 non-null    int64
 5   Self_Employed      614 non-null    int64
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    int64
 12  Loan_Status        614 non-null    int64
dtypes: float64(4), int64(8), object(1)
memory usage: 62.5+ KB

In [96]:
dataset["Dependents"].value_counts()

Dependents
0     345
1     102
2     101
3+     51
Name: count, dtype: int64

In [97]:
dataset["Dependents"]=dataset["Dependents"].fillna(dataset["Dependents"].mode()[0])
dataset["Dependents"]=dataset["Dependents"].replace({"3+":3})
dataset["Dependents"]=dataset["Dependents"].astype("int64")

In [99]:
dataset["Loan_ID"].value_counts()

Loan_ID
LP002990    1
LP001002    1
LP001003    1
LP001005    1
LP001006    1
           ..
LP001020    1
LP001024    1
LP001027    1
LP001028    1
LP001029    1
Name: count, Length: 614, dtype: int64